Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Спецификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>#12082 отключена проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругленияЧислом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеКоличество</Name>
							<Comment>#88</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СпецификацияПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СопутствующиеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Спецификации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		НеобходимыеРеквизиты = "ОсновнаяСпецификация, ОсновнаяСпецификацияКомплектация, ОсновнаяСпецификацияСопутствующиеМатериалы";
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, НеобходимыеРеквизиты);
		// если ВидСпецификации заполнен и был пустой, но был основным в номенклатуре, тогда заменим в номенклатуре признак 
		// (используется при первом ручном заполнении ВидаСпецификации на версии 2.8)
		ДанныеНоменклатурыИзменены = Ложь;
		Если Ссылка.ВидСпецификации = Перечисления.ВидыСпецификации.ПустаяСсылка()
			И ЗначениеЗаполнено(ВидСпецификации)
			И (ДанныеНоменклатуры.ОсновнаяСпецификация = Ссылка
			    ИЛИ ДанныеНоменклатуры.ОсновнаяСпецификацияСопутствующиеМатериалы = Ссылка
				ИЛИ ДанныеНоменклатуры.ОсновнаяСпецификацияКомплектация = Ссылка) Тогда
				
			ИмяРеквизитаОчистки = "ОсновнаяСпецификация";
			ИмяРеквизитаЗаполнения = "ОсновнаяСпецификация";
			Если ДанныеНоменклатуры.ОсновнаяСпецификацияСопутствующиеМатериалы = Ссылка Тогда
				ИмяРеквизитаОчистки = "ОсновнаяСпецификацияСопутствующиеМатериалы";
			ИначеЕсли ДанныеНоменклатуры.ОсновнаяСпецификацияКомплектация = Ссылка Тогда
				ИмяРеквизитаОчистки = "ОсновнаяСпецификацияКомплектация";
			КонецЕсли;
			Если ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы Тогда
				ИмяРеквизитаЗаполнения = "ОсновнаяСпецификацияСопутствующиеМатериалы";
			ИначеЕсли ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация Тогда
				ИмяРеквизитаЗаполнения = "ОсновнаяСпецификацияКомплектация";
			КонецЕсли;
			
			Если НЕ ИмяРеквизитаОчистки = ИмяРеквизитаЗаполнения Тогда
				НоменклатураОбъект = Владелец.ПолучитьОбъект();
				НоменклатураОбъект[ИмяРеквизитаОчистки] = Справочники.Спецификации.ПустаяСсылка();
				НоменклатураОбъект[ИмяРеквизитаЗаполнения] = Ссылка;
				Попытка
					НоменклатураОбъект.Записать();
					ДанныеНоменклатурыИзменены = Истина;
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка сохранения владельца: " + ОписаниеОшибки(), , ,  ,Отказ);
					Возврат;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеНоменклатурыИзменены Тогда
			ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, НеобходимыеРеквизиты); // получаем еще раз после записи
		КонецЕсли;
		Если (ДанныеНоменклатуры.ОсновнаяСпецификация = Ссылка 
			И НЕ ВидСпецификации = Перечисления.ВидыСпецификации.СпецификацияПродукции) 
			ИЛИ  (ДанныеНоменклатуры.ОсновнаяСпецификацияСопутствующиеМатериалы = Ссылка 
			И НЕ ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы)
			ИЛИ  (ДанныеНоменклатуры.ОсновнаяСпецификацияКомплектация = Ссылка 
			И НЕ ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация)
			Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид спецификации не соответствует выбранному виду основной спецификации номенклатуры", , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
